### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [238]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [239]:
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [240]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [336]:
#purchase_data["SN"].unique()

In [242]:
Total_Players = len(purchase_data["SN"].unique())
Total_Players

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [243]:
unique_items = len(purchase_data["Item ID"].unique())
average_price = purchase_data["Price"].mean()
purchases = purchase_data["Purchase ID"].count()
total_revenue = purchase_data["Price"].sum()

In [244]:
summary_table = pd.DataFrame({"Number of Unique Items": unique_items,
                              "Average Price": [average_price],
                              "Number of Purchases": [purchases],
                              "Total Revenue": [total_revenue]})
summary_table

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [245]:
unique_sn_df = purchase_data[["Gender", "SN"]].drop_duplicates()

In [246]:
total_gender = unique_sn_df["Gender"].count()
male2 = unique_sn_df["Gender"].value_counts()['Male']
female2 = unique_sn_df["Gender"].value_counts()['Female']
other2 = total_gender - male2 - female2

In [247]:
male_percent = (male2/total_gender) * 100
female_percent = (female2/total_gender) * 100
other_percent = (other2/total_gender) * 100

In [248]:
Demo_table = pd.DataFrame({"Male": male_percent,
                            "Female": [female_percent],
                            "Other/Non-Disclosed": [other_percent]})

Demo_table

        Male   Female  Other/Non-Disclosed
0  84.027778  14.0625             1.909722

In [249]:
Demo_table["Male"]=Demo_table["Male"].map(
    "{0:,.2f}%".format)
Demo_table["Female"]=Demo_table["Female"].map(
    "{0:,.2f}%".format)
Demo_table["Other/Non-Disclosed"]=Demo_table["Other/Non-Disclosed"].map(
    "{0:,.2f}%".format)

Demo_table

     Male  Female Other/Non-Disclosed
0  84.03%  14.06%               1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [250]:
grouped_by_gender = purchase_data.groupby(["Gender"])

grouped_by_gender["Purchase ID"].count()
grouped_by_gender["Price"].mean()
grouped_by_gender["Price"].sum()

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [251]:
#pd.concat([gender_purch_cnt, gender_purch_mean, gender_purch_sum], axis=1)

In [252]:
gender_purch_cnt=purchase_data.groupby("Gender")["Purchase ID"].count()
gender_purch_mean=purchase_data.groupby("Gender")["Price"].mean()
gender_purch_sum=purchase_data.groupby("Gender")["Price"].sum()

In [253]:
gender_purch_avgm= (gender_purch_sum/male2)
gender_purch_avgf= (gender_purch_sum/female2)
gender_purch_avgo= (gender_purch_sum/other2)

In [254]:
purch_analy =pd.DataFrame({"Purchase Count": gender_purch_cnt, "Average Purchase Price": gender_purch_mean, "Total Purchase Value": gender_purch_sum
             ,"Average Purchase Total per Person by Gender": gender_purch_avgm})

purch_analy

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
Gender,,,,
Female,113,3.203009,361.94,0.747810
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,0.103698

In [255]:
purch_analy["Purchase Count"]=purch_analy["Purchase Count"].map(
    "{0:,.2f}".format)
purch_analy["Average Purchase Price"]=purch_analy["Average Purchase Price"].map(
    "${0:,.2f}".format)
purch_analy["Total Purchase Value"]=purch_analy["Total Purchase Value"].map
"${0:,.2f}".format
purch_analy["Average Purchase Total per Person by Gender"]=purch_analy["Average Purchase Total per Person by Gender"].map
"${0:,.2f}".format

purch_analy

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
Gender,,,,
Female,113.00,$3.20,<bound method Series.map of Gender\nFemale ...,<bound method Series.map of Gender\nFemale ...
Male,652.00,$3.02,<bound method Series.map of Gender\nFemale ...,<bound method Series.map of Gender\nFemale ...
Other / Non-Disclosed,15.00,$3.35,<bound method Series.map of Gender\nFemale ...,<bound method Series.map of Gender\nFemale ...

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [256]:
unique_sn_df2 = purchase_data[["Gender", "SN", "Age"]].drop_duplicates()

In [257]:
unique_sn_df2.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [258]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [259]:
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 49]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [260]:
pd.cut(unique_sn_df2["Age"], age_bins, labels = age_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [261]:
unique_sn_df2["Age Group"] = pd.cut(unique_sn_df2["Age"], age_bins, labels = age_labels)

unique_sn_df2.head()

  Gender             SN  Age Age Group
0   Male        Lisim78   20     20-24
1   Male    Lisovynya38   40       40+
2   Male     Ithergue48   24     20-24
3   Male  Chamassasya86   24     20-24
4   Male      Iskosia90   23     20-24

In [262]:
age_group = unique_sn_df2.groupby("Age Group")

In [263]:
age_group["Age"].count()

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [264]:
age_demo = age_group["Age"].count()

In [265]:
age_demo_perc= (age_demo/Total_Players) * 100

In [266]:
age_demo_perc

Age Group
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: Age, dtype: float64

In [331]:
age_df = pd.DataFrame({"Total Count": age_demo, "Percentage of Players": age_demo_perc})

In [335]:
#age_df

In [333]:
age_df["Total Count"]=age_df["Total Count"].map(
    "{0:,.2f}".format)
age_df["Percentage of Players"]=age_df["Percentage of Players"].map(
    "{0:,.2f}%".format)

In [334]:
age_df

          Total Count Percentage of Players
Age Group
<10             17.00                 2.95%
10-14           22.00                 3.82%
15-19          107.00                18.58%
20-24          258.00                44.79%
25-29           77.00                13.37%
30-34           52.00                 9.03%
35-39           31.00                 5.38%
40+             12.00                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [269]:
unique_sn_df3 = purchase_data[["Gender", "Age"]]

In [270]:
age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 49]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
pd.cut(unique_sn_df3["Age"], age_bins, labels = age_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [271]:
unique_sn_df3["Age Group"] = pd.cut(unique_sn_df3["Age"], age_bins, labels = age_labels)

C:\Users\jburr\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [272]:
age_group2 = unique_sn_df3.groupby("Age Group")

print(age_group2["Age"].count())

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [273]:
age_demo2 = age_group2["Age"].count()

In [274]:
age_group2 = age_group["Age"].count()

In [286]:
avg_purch_price = purchase_data.groupby("Age Group")["Price"].sum()

In [276]:
#avg_purch_price

In [277]:
avg_purch_price2 = (avg_purch_price/age_demo2)

In [278]:
#avg_purch_price2

In [279]:
avg_total_pp = (avg_purch_price/age_group2)

In [280]:
#avg_total_pp

In [281]:
age_df2 = pd.DataFrame({"Purchase Count": age_demo2, "Average Purchase Price": avg_purch_price2, "Total Purchase Value": avg_purch_price, "Avg Total Purchase per Person": avg_total_pp})

In [282]:
age_df2

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.810769,36.54,3.045000

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [345]:
top_spend = purchase_data.groupby(["SN", "Purchase ID"])

In [350]:
top_spend2=

                             Age  Gender  Item ID  Item Name  Price
SN              Purchase ID
Adairialis76    467            1       1        1          1      1
Adastirin33     142            1       1        1          1      1
Aeda94          388            1       1        1          1      1
Aela59          28             1       1        1          1      1
Aelaria33       630            1       1        1          1      1
Aelastirin39    218            1       1        1          1      1
                766            1       1        1          1      1
Aelidru27       705            1       1        1          1      1
Aelin32         52             1       1        1          1      1
                87             1       1        1          1      1
                584            1       1        1          1      1
Aelly27         43             1       1        1          1      1
                428            1       1        1          1      1
Aellynun67      286            1       1        1          1      1
Aellyria80      746            1       1        1          1      1
Aelollo59       203            1       1        1          1      1
                431            1       1        1          1      1
Aenarap34       183            1       1        1          1      1
Aeral43         263            1       1        1          1      1
Aeral68         674            1       1        1          1      1
Aeral97         167            1       1        1          1      1
Aeralria27      32             1       1        1          1      1
Aeralstical35   583            1       1        1          1      1
Aeri84          303            1       1        1          1      1
Aerillorin70    381            1       1        1          1      1
Aerithllora36   274            1       1        1          1      1
                578            1       1        1          1      1
Aerithnucal56   324            1       1        1          1      1
Aerithnuphos61  517            1       1        1          1      1
Aerithriaphos45 40             1       1        1          1      1
...                          ...     ...      ...        ...    ...
Yadaphos40      62             1       1        1          1      1
                421            1       1        1          1      1
Yalae81         5              1       1        1          1      1
                447            1       1        1          1      1
Yalaeria91      681            1       1        1          1      1
Yaliru88        59             1       1        1          1      1
Yalo85          383            1       1        1          1      1
Yalostiphos68   518            1       1        1          1      1
Yana46          280            1       1        1          1      1
Yarithllodeu72  364            1       1        1          1      1
Yarithrgue83    279            1       1        1          1      1
Yarithrin84     698            1       1        1          1      1
Yarithsurgue62  231            1       1        1          1      1
Yarolwen77      696            1       1        1          1      1
Yasrisu92       46             1       1        1          1      1
Yastyriaphos75  340            1       1        1          1      1
Yasur35         257            1       1        1          1      1
Yasur85         514            1       1        1          1      1
Yathecal72      777            1       1        1          1      1
Yathecal82      125            1       1        1          1      1
                548            1       1        1          1      1
                727            1       1        1          1      1
Yathedeu43      93             1       1        1          1      1
                595            1       1        1          1      1
Yoishirrala98   572            1       1        1          1      1
Zhisrisu83      54             1       1        1          1      1
                141            1       1        1          1      1
Zontibe81       17             1       1        1          1      1
                442            1       1        1          1      1
                560            1       1        1          1      1

[780 rows x 5 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80